["Who will be elected NYC mayor in 2017?", "Who will be elected Boston mayor in 2017?", "Who will be elected Detroit mayor in 2017?", "Who will be elected Minneapolis mayor in 2017?", "Who will be elected Seattle mayor in 2017?", "Who will be elected Cincinnati mayor in 2017?", "Who will be elected Cleveland mayor in 2017?", "Who will be elected Charlotte mayor in 2017?", "Who will be elected Pittsburgh mayor in 2017?", "Will Hillary Clinton run for NYC mayor in 2017?", "Which party will win the 2017 Virginia gubernatorial race?", "Which party will win the 2017 New Jersey gubernatorial race?", "Who will win the Virginia Democratic gubernatorial primary?", "Who will win the Virginia Republican gubernatorial primary?", "Who will win the New Jersey Democratic gubernatorial primary?", "Who will win the New Jersey Republican gubernatorial primary?", "Will \"Calexit\" initiative qualify for the 2018 ballot in California?", "Which party will win the 2020 U.S. presidential election?", "Will Mark Cuban run for president in 2020?", "Will Kirsten Gillibrand run for president in 2020?", "Will Cory Booker run for president in 2020?", "Will Andrew Cuomo run for president in 2020?", "Will a woman be elected U.S. president in 2020?", "Will the 2020 Democratic nominee for president be a woman?", "Will the 2020 Republican nominee for president be a woman?", "Will Facebook's Mark Zuckerberg run for president in 2020?", "Will Bernie Sanders run for president in 2020?", "Will Amy Klobuchar run for president in 2020?", "Will Elizabeth Warren run for president in 2020?", "Will John Kasich run for president in 2020?", "Will Ted Cruz run for president in 2020?", "Will Dwayne \"the Rock\" Johnson run for president in 2020?", "Which party will control the Senate after 2018 midterms?", "Which party will control the House after 2018 midterms?", "How many House seats will the GOP hold after 2018 midterms?", "How many Senate seats will the GOP hold after 2018 midterms?", "Will Caroline Kennedy run for Congress or Senate in 2018?", "Will Elizabeth Warren be re-elected to the U.S. Senate in Massachusetts in 2018?", "Will Ted Cruz be re-elected to the U.S. Senate in Texas in 2018?", "Who will win the 2017 House of Representatives special election in Georgia's 6th District?", "Will Bernie Sanders be re-elected to the U.S. Senate in Vermont in 2018?", "Will Joe Manchin be re-elected to the U.S. Senate in West Virginia in 2018?", "Will Joe Donnelly be re-elected to the U.S. Senate in Indiana in 2018?", "Will Bill Nelson be re-elected to the U.S. Senate in Florida in 2018?", "Who will win the 2018 Indiana Republican Senate primary?", "Who will win the 2018 Florida Republican Senate primary?", "Who will win the 2017 House of Representatives special election in South Carolina's 5th District?", "Who will win the 2018 Utah Republican Senate primary?", "Will Mitt Romney run for Senate in 2018?", "Will Mark Meadows win the 2018 Republican primary in North Carolina's 11th Congressional District?", "Will Raul Labrador win the 2018 Republican primary in Idaho's 1st Congressional District?", "Which party will win the 2018 House of Representatives race in Utah's 3rd district?", "Who will win the 2017 House of Representatives special election in California's 34th District?", "What will the margin of victory be in the 2017 special election in California's 34th District?", "What will the margin of victory be in the 2017 special election in South Carolina's 5th District?", "What will the margin of victory be in the 2017 special election in Georgia's 6th District?", "Will Joe Manchin win the 2018 West Virginia Democratic Senate primary?", "Who will win the 2017 House of Representatives special election in Utah's 3rd District?", "Who will win the 2017 U.S. Senate special election in Alabama?", "Will a federal minimum wage increase go into effect by year-end 2017?", "Will the individual tax rate be cut by the end of 2017?", "Will the corporate tax rate be cut by the end of 2017?", "Will the ACA individual mandate be repealed by the end of 2017?", "Will the ACA employer mandate be repealed by the end of 2017?", "Will the ACA medical device tax be repealed by the end of 2017?", "Will ACA plan subsidies be repealed by the end of 2017?", "Will ACA preexisting condition provision be repealed by the end of 2017?", "Will Trump sign a bill not supported by a majority of GOP House delegation in 2017?", "Will Congress pass a resolution to amend the Constitution, abolishing the Electoral College, by end of 2017?", "Will national right-to-work legislation be enacted in 2017?", "Will 2017 legislation classify carried interest as ordinary income?", "Will Congress ratify the Trans-Pacific Partnership in 2017?", "Will the prime minister of Israel address the U.S. Congress in 2017?", "Will legislation strip federal funds from sanctuary cities in 2017?", "Will Barack Obama publicly testify before Congress in 2017?", "Will the Senate invoke the nuclear option for the health care reform bill by end of 2017?", "Will Paul Ryan be Speaker of the House on June 30?", "Will Congress establish a select committee on Russian election interference by June 30?", "Will Susan Rice publicly testify before Congress by June 30?", "Will Devin Nunes be House Intelligence Committee chairman on June 30, 2017?", "Will the alternative minimum tax be repealed in 2017?", "Will the estate tax be repealed in 2017?", "Will Trump sign a bill not supported by a majority of GOP House delegation in May 2017?", "Will James Comey publicly testify before Congress by May 31?", "Will any Democrat vote to confirm Trump's FBI director nominee by June 30?", "Will the House of Representatives pass the Financial CHOICE Act by May 31?", "What will congressional job approval be on June 5?", "Will the Senate end the legislative filibuster in 2017?", "Who will be the next justice to leave the Supreme Court?", "Will there be another SCOTUS vacancy in 2017?", "Will Supreme Court agree by year-end to hear a Trump emoluments case?", "Will Supreme Court agree by year-end to hear a case on Trump's \"travel ban\"?", "Will Supreme Court grant certiorari by year-end in NJ sports betting case?", "Who will be Trump's next Supreme Court nominee?", "Will Janet Yellen be Federal Reserve chair on June 30, 2017?", "Will the U.S. label China a currency manipulator by June 30?", "How much will Trump increase/decrease the debt in his first year?", "Will James Comey be FBI director on June 30, 2017?", "Will a federal criminal charge be filed against Hillary Clinton in 2017?", "Will Andrew Cuomo be governor of New York at year-end?", "Will Chris Christie be governor of New Jersey at year-end?", "Will Richard Cordray be CFPB director at year-end?", "Will Trump testify in Zervos defamation case in 2017?", "Will Illinois make Obama's birthday a holiday in 2017?", "Will Sarah Palin become U.S. ambassador to Canada in 2017?", "Will Edward Snowden be returned to the U.S. in 2017?", "Who will be FDA Commissioner on June 30, 2017?", "Will a false statement federal criminal charge be filed against Michael Flynn in 2017?", "Will Los Angeles be selected to host the 2024 Summer Olympics?", "Will Jeff Sessions be sanctioned in Alabama in 2017?", "What will be the result of the 2017 Puerto Rican status referendum?", "Will the 9th Circuit overturn the revised travel ban injunction by May 31?", "Who will be Senate-confirmed Fed Chair on February 4, 2018?", "What will \"Right Direction\" poll at on June 5?", "Will Trump move the U.S. embassy in Israel to Jerusalem in 2017?", "Will Trump withdraw from the Paris Agreement in 2017?", "Will President Trump travel to Taiwan in 2017?", "Will Donald Trump be president at year-end 2017?", "Will Sean Spicer be White House press secretary on Dec. 31, 2017?", "Will Donald Trump be president at year-end 2018?", "Will Donald Trump be impeached in 2017?", "What will Trump's RCP average job approval be at end of day May 31?", "What will Trump's RCP average job approval be at end of day June 30?", "Will President Trump travel to Russia in 2017?", "Will Trump meet with Mexican President Peña Nieto in 2017?", "Will Trump meet with Kim Jong-un in 2017?", "Will Trump meet with Rodrigo Duterte at the White House in 2017?", "Who will be Senate-confirmed FBI Director on June 30, 2017?", "Will Rod Rosenstein be Deputy Attorney General on May 31, 2017?", "Will Reince Priebus be White House chief of staff on May 31, 2017?", "Will Sean Spicer be White House press secretary on May 31, 2017?", "Will 25th Amendment, Section 4 be invoked in 2017?", "Will Donald Trump be president on Sept. 30?", "What will Trump's RCP average job approval be at end of day July 31?", "Will Mike Pence be vice president at year-end 2017?", "Will a federal criminal charge be filed against Jared Kushner in 2017?", "How many @realDonaldTrump tweets will mention \"peace\" from noon 5/25 - noon 6/1?", "How many tweets will @vp post from noon May 26 to noon June 2?", "Will Trump's Gallup approval be 39% or higher for May 30 - June 1?", "What will Trump's RCP average job approval be at end of day June 2?", "How many tweets will @potus post from noon May 30 to noon June 6?", "How many tweets will @vp post from noon May 30 to noon June 6?", "Who will be the next White House communications director?", "How many tweets will @realDonaldTrump post from noon May 31 to noon June 7?", "Who will be White House chief of staff on June 30?", "Will Benjamin Netanyahu be prime minister of Israel at year-end?", "Who will win the 2017 Liberian presidential election?", "Will Uhuru Kenyatta be re-elected president of Kenya in 2017?", "Will Paul Kagame be re-elected president of Rwanda in 2017?", "Will Bashar al-Assad be president of Syria on Dec. 31, 2017?", "Will Jacob Zuma be president of South Africa on Dec. 31, 2017?", "Will Raúl Castro stay in power through 2017?", "Will Nicolás Maduro be president of Venezuela on Dec. 31, 2017?", "Will Michel Temer be president of Brazil on July 31, 2017?", "Which party will win the next New Zealand general election?", "Who will be New Zealand's National Party leader at the end of 2017?", "Who will be New Zealand's Labour Party leader at the end of 2017?", "Who will be elected president of India in 2017?", "Will Xi Jinping be president of the People’s Republic of China at the end of 2017?", "Will the Japanese government call for early elections in 2017?", "Who will be elected German chancellor in 2017?", "Will Scottish Parliament call for an independence referendum in 2017?", "Will Trump address British Parliament in 2017?", "Will Vladimir Putin be president of Russia at the end of 2017?", "Will Vladimir Putin be president of Russia at the end of 2018?", "Will Germany meet 2% NATO spending guideline for 2017?", "Who will be the next leader of Ireland’s Fine Gael?", "Who will be the next UK party leader to leave?", "Who will be the next Speaker of the British House of Commons?", "How many seats will the Conservatives win in the 2017 UK snap election?", "Who will be prime minister of the United Kingdom on June 30?", "Who will be prime minister of France on May 31?", "How many seats will the En Marche! party win in the 2017 French legislative election?"]